/********************************************************************
//DM430-L型开发板1602液晶显示ADC转换结果程序，显示输入到ADC的电压转换后的数字量和模拟电压大小
//MSP430单片机内部12位ADC，采用内部2.5V基准，单通道单次转换，中断模式，有精度误差
//通过杜邦线将需要转换的电压加入到ADC0，也就是P60，可以更改输入电压，最大显示量4095和2.5V
//调试环境：EW430 V5.30
//作者：www.avrgcc.com
//时间：2014.03.01
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"                     //开发板配置头文件，主要配置IO端口信息
#include "1602.c"

static uchar Flag=0;                    //标志变量
uint TEMP=0;                            //ADC值暂存变量 
uint    temp,A1,A2,A3,A4,A5,A6,A7;      //定义的变量,显示数据处理

//***********************************************************************
//      显示采集到的ADC数值
//***********************************************************************
void LCD_DisplayADC()
{    
  LCD_write_char(0x0b,0,0x30+A1);
  LCD_write_char(0x0c,0,0x30+A2);
  LCD_write_char(0x0d,0,0x30+A3);
  LCD_write_char(0x0e,0,0X30+A4);
}

void LCD_DisplayVoltage()
{    
  LCD_write_char(0x0b,1,0x30+A5);
  LCD_write_char(0x0c,1,'.');
  LCD_write_char(0x0d,1,0x30+A6);
  LCD_write_char(0x0e,1,0X30+A7);
  LCD_write_char(0x0f,1,'V');
}
//*************************************************************************
//		数字量显示处理函数
//*************************************************************************
void Data_do(uint temp_d)
{
  uint temp_1,temp_2;
  A1=temp_d/1000;                       //分出千，百，十，和个位
  temp_1=temp_d%1000;
  A2=temp_1/100;
  temp_2=temp_1%100;
  A3=temp_2/10;
  A4=temp_2%10;
}

//*************************************************************************
//		电压数据显示处理函数
//*************************************************************************
void Voltage_do(uint temp_d)
{
  uint temp_1,temp_2;
  ulong temp_3;
  
  temp_3=(ulong)(temp_d)*250;            //转换公式，ADC数字量转换为电压大小，注意数据类型
  temp_d=temp_3/4095;                    //12位精度，除以4095
  
  A5=temp_d/100;                        //分出百，十，和个位
  temp_1=temp_d%100;
  A6=temp_1/10;
  temp_2=temp_1%10;
  A7=temp_2;
}

//*************************************************************************
//	ADC初始化程序，用于配置ADC相关寄存器
//*************************************************************************
void ADC_Init()
{
  P6SEL|=0x01;                                    //选择ADC通道
  ADC12CTL0|= ADC12ON + SHT0_2 + REF2_5V + REFON; //ADC电源控制开，16个CLK，内部基准2.5V
  ADC12CTL1|= ADC12SSEL1 + ADC12SSEL0;            //SMCLK做时钟源
  ADC12MCTL0= SREF0 + INCH_0;                     //参考控制位及通道选择，这里选择通道0
  ADC12IE|= 0x01;                                 //中断允许
  ADC12CTL0|= ENC;                                //使能转换器
}

//*************************************************************************
//	ADC中断服务程序
//*************************************************************************
#pragma vector=ADC_VECTOR
__interrupt void ADC12ISR(void)
{
  uchar j;
  while((ADC12CTL1&0x01)==1);           //如果ADC忙，则等待，否则读取ADC转换数值
  Flag = 1 ;
  TEMP = ADC12MEM0;                     //读取ADC转换值
  Data_do(TEMP);                        //处理ADC值，用于显示，数字量
  Voltage_do(TEMP);                     //处理ADC值，用于显示，模拟电压值
  for(j=0;j<15;j++)
  {
    LCD_DisplayADC();                   //显示ADC的数据，ADC数字量
    LCD_DisplayVoltage();               //显示ADC的电压值
  }
}

//***********************************************************************
//            主程序
//***********************************************************************
void main(void)
{ 
  WDT_Init();                         //看门狗初始化
  Clock_Init();                       //时钟初始化
  Port_Init();                        //端口初始化，用于控制IO口输入或输出
  ADC_Init();                         //初始化ADC配置
  delay_ms(100);                      //延时100ms
  LCD_init();                         //液晶参数初始化设置
  LCD_clear();                        //清屏
  LCD_Desk();
  _EINT();                            //使能中断
  Flag=1;                             //标志位先置1
  
  while(1)
  {
    while(Flag==1)
    {
      ADC12CTL0 |= ADC12SC;           //开启转换
      ADC12CTL0 &= ~ADC12SC;          //清零
      Flag=0;                         //清零标志位
    }
  }
}